{
  "version": "https://jsonfeed.org/version/1",
  "title": "Justin Gu",
  "home_page_url": "http://www.justingu.tech",
  "feed_url": "https://example.com/feed/feed.json",
  "description": "CS &amp; BBA Double Degree Student @ University of Waterloo",
  "author": {
    "name": "Justin Gu",
    "url": "http://www.justingu.tech"
  },
  "items": [{
      "id": "http://www.justingu.tech/post/mschf/",
      "url": "http://www.justingu.tech/post/mschf/",
      "title": "MSCHF",
      "content_html": "<h3 id=\"mschf-posters\" tabindex=\"-1\">MSCHF Posters</h3>\n<p>TLDR: In 2020 I designed a series of posters for MSCHF. I’d won an unofficial contest and got my designs placed on a billboard and was featured in an article.</p>\n<p>Back in early 2020, I’d first heard of MSCHF through the MSCHF box, a physical box you can purchase in which you didn’t know the value of. It instantly became an internet sensation and had sold out within a few days. I decided to investigate more into the company which resulted in me joining their largest unofficial discord server where they were hosting a graphic design contest. Being the graphic designer I was, I decided to sign up and submit a few designs I thought were interesting (along with 100 ish other designs from talented designers) and patiently waited not expecting to win anything. However, a few days later, I was contacted by the organizers and that’s when I realized I’d won an (unofficial) MSCHF contest and my design was going to be placed on a billboard in NYC.</p>\n<h3 id=\"the-designs\" tabindex=\"-1\">The Designs</h3>\n<p><img src=\"/mschf/Untitled.png\" alt=\"Design #1: Minimalist but gets to the point. Red accent to attract attention and curiosity immediately, essential for an advert that people only get 2-3 seconds to look at.\"></p>\n<p>Design #1: Minimalist but gets to the point. Red accent to attract attention and curiosity immediately, essential for an advert that people only get 2-3 seconds to look at.</p>\n<p><img src=\"/mschf/Untitled%201.png\" alt=\"Design #2: Another minimalist design but portrays the main idea immediately. Colours are matched quite well. This is personally my favourite one.\"></p>\n<p>Design #2: Another minimalist design but portrays the main idea immediately. Colours are matched quite well. This is personally my favourite one.</p>\n<p><img src=\"/mschf/Untitled%202.png\" alt=\"Design #3: Not sure if you can notice this but the right side is slightly lighter than the left side. This was done because people instantly are attracted to brighter vibrant colors so they look at the picture immediately.\"></p>\n<p>Design #3: Not sure if you can notice this but the right side is slightly lighter than the left side. This was done because people instantly are attracted to brighter vibrant colors so they look at the picture immediately.</p>\n<p><img src=\"/mschf/Untitled%203.png\" alt=\"Design #4: This has an orange overlay on the entire piece to give more of a casual vibe that I got from this drop.\"></p>\n<p>Design #4: This has an orange overlay on the entire piece to give more of a casual vibe that I got from this drop.</p>\n<p><img src=\"/mschf/Untitled%204.png\" alt=\"Design #5: Same idea as the first billboard (the red accent and minimalistic design is to peak reader's interest) , the red lettering spells out &quot;MSCHF, internet's delightful collection.&quot; while readers can choose to read the white text as well\"></p>\n<p>Design #5: Same idea as the first billboard (the red accent and minimalistic design is to peak reader’s interest) , the red lettering spells out “MSCHF, internet’s delightful collection.” while readers can choose to read the white text as well</p>\n<h3 id=\"the-results\" tabindex=\"-1\">The Results</h3>\n<p>Although I wasn’t based in NYC, I asked a member of the server to drive out and take a few pictures. It didn’t take much convincing since everyone wanted to see the billboards on display as well.</p>\n<p><img src=\"/mschf/Untitled%205.png\" alt=\"Untitled\"></p>\n<p><img src=\"/mschf/Untitled%206.png\" alt=\"On March 14th, 2020, Designs #2 and #3 were showcased on the billboards. Apologies for the intense blue tint over the images, the person who took the images said that was a result of his viewing angles.\"></p>\n<p>On March 14th, 2020, Designs #2 and #3 were showcased on the billboards. Apologies for the intense blue tint over the images, the person who took the images said that was a result of his viewing angles.</p>\n<p>Lastly, they were also featured in <a href=\"https://www.canaan.com/latest/laura-chau-the-next-great-consumer-companies-won-t-be-exclusive-clubs-they-will-be-inclusive-cults\">this article</a>. Funny thing, I didn’t even know someone had written about this until I’d search up MSCHF Billboard on Google images and saw my billboards!</p>\n",
      "date_published": "2022-01-05T00:00:00Z"
    },{
      "id": "http://www.justingu.tech/post/toronto-youth-network/",
      "url": "http://www.justingu.tech/post/toronto-youth-network/",
      "title": "Toronto Youth Network",
      "content_html": "<p>TLDR: I created the branding to Toronto Youth Network 2020</p>\n<p>In early 2020, I was approached by my friend George Shao for a pretty exciting opportunity: to host a hackathon. He was running Toronto Youth Network that year, a youth organization specializing in providing meaningful networking skills and had a history of hosting hackathons. We decided to recreate the logo for this years hackathon in order to give the youth network a revamped look.</p>\n<p>After some heavy initial brainstorming,  we knew we had to focus on the CN tower: the landmark of Toronto. Some early versions of the logo were created but were not very pretty.</p>\n<h3 id=\"the-process\" tabindex=\"-1\">The Process</h3>\n<p><img src=\"/torontoYouthNetwork/Untitled.png\" alt=\"Untitled\"></p>\n<p>After some revising and talks with other graphic designers, I was in charge of modelling a quick line sketch of the CN tower as a starting point:</p>\n<p><img src=\"/torontoYouthNetwork/Untitled%203.png\" alt=\"This gradient is really ugly\"></p>\n<p>I added a gradient to the text but then I realized the gradient was really ugly. Thus I decided to go with a solid colour.</p>\n<p><img src=\"/torontoYouthNetwork/Untitled%204.png\" alt=\"A nicer coloured version was created afterwards\"></p>\n<p>I then created a nicer coloured version of the logo. I also added some shadows and highlights to the CN tower to make it look more 3D.</p>\n<p>Finally, after realizing this colourful logo wasn’t going to work on most merchandise due to it’s huge range of colours I decided to only keep the shadows of the CN tower completely black.</p>\n<p><img src=\"/torontoYouthNetwork/Untitled%206.jpg\" alt=\"A screenshot of me changing all the shadows to be pure black\"></p>\n<p>A screenshot of me changing all the shadows to be pure black</p>\n<h3 id=\"the-result\" tabindex=\"-1\">The Result</h3>\n<p><img src=\"/torontoYouthNetwork/Untitled%205.png\" alt=\"After some tweaks, the logo was finally ready to be used in production! \"></p>\n<p>After some tweaks, the logo was finally ready to be used in production!</p>\n<p>It was really fun and challenging working for the Toronto Youth Network. I’d definitely learned a lot working with other designers as well and I’d quite happy with how the final logo turned out :). After designing this, I had an even bigger task ahead of me: <a href=\"../6ixbits/\">the hackathon we were hosting</a>.</p>\n",
      "date_published": "2022-01-04T00:00:00Z"
    },{
      "id": "http://www.justingu.tech/post/6ixbits/",
      "url": "http://www.justingu.tech/post/6ixbits/",
      "title": "6ixBits",
      "content_html": "<p>TLDR: I was in charge of creating sponsorship packages, assets, social media posts for the hackathon 6ixbits, hosted by the <a href=\"../toronto-youth-network\">Toronto Youth Network</a>.</p>\n<p>In late 2020, I was tasked with creating the branding for 6ixBits, a hackathon being hosted by the youth organization I was part of, Toronto Youth Network. This was after I’d created the branding for the Toronto Youth Network which you can read about <a href=\"../toronto-youth-network\">here</a>. Anyways, I began by spending a lot of time on voice calls brainstorming designs: here are a few assets I came up with.</p>\n<h3 id=\"assets\" tabindex=\"-1\">Assets</h3>\n<p>I started off with assets since it would be relatively simple creating social media posts and sponsorship packages with a set theme. Furthermore, they needed to be incorporated on the website which can be viewed <a href=\"https://torontoyouthnetwork.com/6ixbits\">here</a>. My theme was Toronto and Canada since it was going to be a virtual hackathon. They were all created in Adobe Illustrator.</p>\n<p><img src=\"/6ixBits/Untitled.png\" alt=\"Laptop since the Hackathon is tech-related\"></p>\n<p>Laptop since the Hackathon is tech-related</p>\n<p><img src=\"/6ixBits/6bcntowerbackground.svg\" alt=\"Various clouds and the sun for use in later illustrations\"></p>\n<p>Various clouds and the sun for use in later illustrations</p>\n<p><img src=\"/6ixBits/6blogo.svg\" alt=\"The logo was a barcode combined with the skyline of Toronto representing the intersection of information and our home\"></p>\n<p>The logo was a barcode combined with the skyline of Toronto representing the intersection of information and our home</p>\n<p><img src=\"/6ixBits/6btree.svg\" alt=\"The Maple tree, a staple of Canadian culture\"></p>\n<p>The Maple tree, a staple of Canadian culture</p>\n<h3 id=\"social-media-posts\" tabindex=\"-1\">Social Media Posts</h3>\n<p>I created these social media posts to campaign for the Hackathon. Overall it resulted in 100+ people attending the Hackathon which I thought was fairly good for our first Hackathon hosted. The assets were created and piece together in Illustrator.</p>\n<p><img src=\"/6ixbits/6bgiftcard_giveaway.png\" alt=\"I was heavily inspired by Banff’s mountain and lake scenery when creating this piece.\"></p>\n<p>I was heavily inspired by Banff’s mountain and lake scenery when creating this piece.</p>\n<p><img src=\"/6ixbits/TRSS_promo.png\" alt=\"Once again going with the mountain theme but also incorporating an inukshuk and the CN tower, recognizable objects in Canadian culture.\"></p>\n<p>Once again going with the mountain theme but also incorporating an inukshuk and the CN tower, recognizable objects in Canadian culture.</p>\n<h3 id=\"sponsorship-package\" tabindex=\"-1\">Sponsorship Package</h3>\n<p>Finally, I created a sponsorship package which was sent out to 100+ sponsors. We had 20% of sponsors emailing back, willing to sponsor us. The package was created using assets made in Illustrator and pieced together on InDesign.</p>\n<p><a href=\"/6ixBits/6ixBits_Sponsorship.pdf\"><img src=\"/6ixBits/sponsorshipPackage.png\" alt=\"Image of Sponsorship Package\"></a></p>\n<p>Please click the image below if you wish to take a look at the full sponsorship package. Although InDesign was a bit challenging to figure out, it was a fun process learning and creating this package.</p>\n<h3 id=\"final-remarks\" tabindex=\"-1\">Final Remarks</h3>\n<p>Being able to host this hackathon was a bit of work, but seeing it pay of was really rewarding. I’d grateful for the opportunity to have participated in something like this and I definitely learned a lot of new graphic design skills such as InDesign that I wouldn’t have learned from anywhere else.</p>\n",
      "date_published": "2022-01-03T00:00:00Z"
    }
  ]
}